# -*- coding: utf-8 -*-
"""
Created on Fri Nov 12 00:28:04 2021

@author: 1
"""

#Описание человека списком или словарем
Group=[['Петров','Пермь', 1988,10,2, 175, 80,'инженер'],
       ['Сидоров','Самара', 1993,4,2, 193, 100,'менеджер'],
       ['Попов','Екб', 2001,12,21, 166, 70,'водитель']]
x= 1
#while x-1 <= 3:
    Group[x][2]
#    x +=1
#max_got= max(Group[x][2])
           

print (Group[x][2])


# Ivanov ={
#     "Иванов П.Х.":
#     {     'год рождения' : 1988,
#           'рост' : 175,
#           'вес' : 80,
#           'город' : 'Пермь',
#           'место работы' : 'Технекон',
#           'должность' : 'инженер'}
#           }
# x=Ivanov.get[ "Иванов П.Х.",  'рост']
# print (x)