# -*- coding: utf-8 -*-
"""
Spyder Editor

This is a temporary script file.
"""
# заменить все буквы "x" на "y"
#исходная_строка = "asdfgds xxx bxbb"
# 
# новая_сторка = ""
# for y in исходная_строка:    # перебор символов
#     if y== "x":                 #если текущее- x
#         новая_сторка += 'y'       # то заменяем его на y
#     else:
#         новая_сторка += y       # оставим как есть
        
# print(исходная_строка)          # выводим две строки для сравнения
# print(новая_сторка)

# числа = [1,2,3,4,5,6,5,4,3,4,5,6,7]
# произведение = 1                            #начальное значение 1
# for x in числа:
#     произведение *=x
# print(произведение)    

# числа = [1,2,3,4,5,6,5,4,55,4,155,6,7]
# произведение = 1                            #начальное значение 1
# for x in числа:
#     if x // 5== x/5 or x//3== x/3:
#         произведение *=x
# print(произведение)    

# исходная_строка = "asdfgds xxx bxbb"
# новая_сторка="asdfgds xxx bxbb".replace("x","y")
# print(новая_сторка)    
  
 
