# -*- coding: utf-8 -*-
"""
Created on Fri Nov 12 00:28:04 2021

@author: 1
"""

#Работа над списком 
Group=[['Петров', 1988,10,2, 175, 80],
        ['Сидоров', 1993,4,2, 193, 100],
        ['Попов', 2001,12,21, 166, 70]]


year=Group[0][1] # год рождения Первого
for x in [1,2]:    
    y=Group[x][1]
    if year < y:
        year =y
        man=Group[x][0]
print (man,year)

#Работа над словарем
Group =[
        {'Stud':"Иванов",'год рождения' : 1988, 'рост' : 175,  'вес' : 80},     
        {'Stud':"Сидоров",'год рождения' : 1983, 'рост' : 196,  'вес' : 100}, 
        {'Stud':"Попов",'год рождения' : 2003, 'рост' : 166,  'вес' : 70}    
        ]       
long=Group[0]['рост'] # год рождения Первого
for x in [1,2]:    
      y=Group[x]['рост']
      if long < y:
            long =y
            man=Group[x]['Stud']
print ("самый высокий студент", man, "его рост", long, "cм")              
            
